# Assignment 3 (Part 2) -- SQL 3

Complete the problems in this notebook.
It does not matter whether you show the output of each code block.
Submit your resulting .ipynb file on Canvas.

**Specify which course you are in, COMP 430 or 533:**

First, the standard preliminary steps.  For security, don't include your ricedb password.

In [3]:
%load_ext sql

/Users/user/anaconda/lib/python2.7/site-packages/IPython/config.py:13: ShimWarning: The `IPython.config` package has been deprecated. You should import from traitlets.config instead.
  "You should import from traitlets.config instead.", ShimWarning)
/Users/user/anaconda/lib/python2.7/site-packages/IPython/utils/traitlets.py:5: UserWarning: IPython.utils.traitlets has moved to a top-level traitlets package.
  warn("IPython.utils.traitlets has moved to a top-level traitlets package.")

In [4]:
%sql postgresql://ricedb:zt940107@localhost/postgres

u'Connected: ricedb@postgres'

# Problem 1

For this problem, we'll give you the same schemas and data as on Assignment 2, except that we've added two new climbers.
We are modeling a climbing club, where groups of members go together on climbs to various mountain peaks.

Schemas:
* Peak (<u>name</u>, elevation, difficulty, region)
  Difficulty is on a scale of 1 to 5.
* Climber (<u>name</u>, gender)
* Participate (<u>trip_id</u>, <u>climber_name</u>)
  Describes who participated in each climbing trip.
  Assume we only keep track of those who finish a climb.
* Climb (<u>trip_id</u>, peak_name, date) --
  We will assume that a climbing trip exists only if at
  least one person participated in it.
  While there is a way to enforce such a constraint, we haven't seen that yet.
      
In each part, if you use `CREATE VIEW`, then start your answer with the corresponding `DROP VIEW IF EXISTS`.  Here, when creating the tables, we use `DROP TABLE ... CASCADE` so that any dependent views are also dropped.

In [5]:
%%sql

DROP TABLE IF EXISTS Participate CASCADE;
DROP TABLE IF EXISTS Climb CASCADE;
DROP TABLE IF EXISTS Climber CASCADE;
DROP TABLE IF EXISTS Peak CASCADE;

CREATE TABLE Peak (
    name varchar(50),
    elevation INT,
    difficulty INT,
    region varchar(50),
    PRIMARY KEY (name)
);

CREATE TABLE Climber (
    name varchar(50),
    gender char(1),
    PRIMARY KEY (name)
);

CREATE TABLE Climb (
    trip_id INT,
    peak_name varchar(50),
    date DATE,
    PRIMARY KEY (trip_id)
);

CREATE TABLE Participate (
    trip_id INT,
    climber_name varchar(50),
    PRIMARY KEY (trip_id, climber_name),
    FOREIGN KEY (climber_name) REFERENCES Climber (name),
    FOREIGN KEY (trip_id) REFERENCES Climb (trip_id)
);

INSERT INTO Peak VALUES
    ('Everest', 29029, 5, 'Himalayas'),
    ('Mount Ranier', 14409, 4, 'Rocky Mountains'),
    ('Pikes Peak', 14114, 3, 'Rocky Mountains'),
    ('K2', 28251, 5, 'Himalayas'),
    ('Kilimanjaro', 19341, 4, 'Eastern Rift'),
    ('Corcoran', 13760, 2, 'Corcoran to Whitney'),
    ('Whitney', 14505, 3, 'Corcoran to Whitney'),
    ('Mallory', 13845, 2, 'Corcoran to Whitney'),
    ('Irvine', 13780, 2, 'Corcoran to Whitney');

INSERT INTO Climber VALUES
    ('Anna',  'F'),
    ('Beth',  'F'),
    ('Chad',  'M'),
    ('David', 'M'),
    ('Ellen', 'F'),
    ('Frank', 'M'),
    ('George', 'M'),
    ('Helen', 'F');

INSERT INTO Climb VALUES
    (1, 'Everest', '2015-01-01'),
    (2, 'Mount Ranier', '2016-01-16'),
    (3, 'Pikes Peak', '2016-01-30'),
    (4, 'Everest', '2016-02-04'),
    (5, 'Pikes Peak', '2015-01-02'),
    (6, 'K2', '2015-04-04'),
    (7, 'Whitney', '2016-01-12');

INSERT INTO Participate VALUES
    (1, 'Beth'),
    (1, 'Ellen'),
    (1, 'David'),
    (2, 'Beth'),
    (2, 'Ellen'),
    (3, 'Anna'),
    (3, 'Chad'),
    (3, 'David'),
    (3, 'Frank'),
    (5, 'Anna'),
    (6, 'Anna'),
    (7, 'Anna'),
    (7, 'Chad');

Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
9 rows affected.
8 rows affected.
7 rows affected.
13 rows affected.

[]

## Part a (12 points -- 6 points each query)

We want to find all the climbers who have not yet participated in any climb.  You'll write two versions.  The results should just have the climbers' `name`.

First, a version with `EXISTS` or `NOT EXISTS`.  You cannot use joins, set membership, (multi)set operations, or the other versions of quantification.

In [17]:
%%sql
select *
from Climber
where not exists(
select *
from Participate
where Climber.name = Participate.climber_name)

2 rows affected.

[(u'George', u'M'), (u'Helen', u'F')]

Next, a version with `LEFT OUTER JOIN`.  You cannot use other joins, set membership, (multi)set operations, or quantification.

In [16]:
%%sql
select *
from Climber
left outer join Participate on Climber.name = Participate.climber_name
where Participate.climber_name is NULL

2 rows affected.

[(u'George', u'M', None, None), (u'Helen', u'F', None, None)]

## Part b (12 points -- 6 points each)

What is the average height of the unclimbed peaks in the `'Corcoran to Whitney'` region?  You'll write two versions.

First, a version using set membership: `IN` or `NOT IN`.  You cannot use joins, (multi)set operations, or quantification.

In [56]:
%%sql
drop view if exists CW;
create view CW as
    select name
    from Peak
    where region = 'Corcoran to Whitney';
    
    select Avg(elevation)
    from Peak
    where Peak.name in(
        select name 
        from CW
        where name not in(
            select peak_name
            from Climb
            )
        )

Done.
Done.
1 rows affected.

[(Decimal('13795.000000000000'),)]

Next, a version with set or multiset operations: `UNION`, `INTERSECT`, or `EXCEPT`, possibly with `... ALL`.  You can use one join.  You cannot use set membership or quantification.

In [54]:
%%sql
drop view if exists c_w;
create View c_w as
 select name
       from peak
        where region='Corcoran to Whitney'
    intersect
    select peak_name
    from Climb;

select Avg(elevation)
from peak
where name in(
    select name
    from Peak
    where region='Corcoran to Whitney'
    EXCEPT
    select name
    from c_w   
    )

Done.
Done.
1 rows affected.

[(Decimal('13795.000000000000'),)]

## Part c (10 points)

We would like to ensure that every `Climb` has at least one climber participating.  After all, it doesn't make much sense to say there was a climb when no one did it.

Given what we have seen so far in the course, can we do this?  If so, add a code cell with the appropriate `ADD CONSTRAINT`.  If not, add a MarkDown cell and explain why not.

In [ ]:
The constraint cannot added as suggested. If every Climb should have at least one climber, participate table should have
a corresponding trip_id and not null climber_name. But We need to insert a tuple with trip_id,peak_name and date to create a trip, 
only after we create that trip can we insert climbers into participate. So before inserting climbers into participate
tables, we can not constrain that every climb has at least one climber.

# Problem 2 (16 points)

In [57]:
%%sql

DROP TABLE IF EXISTS R;
DROP TABLE IF EXISTS S;
DROP TABLE IF EXISTS T;

CREATE TABLE R (a INT);
CREATE TABLE S (a INT);
CREATE TABLE T (a INT);

SELECT DISTINCT R.a
FROM R
CROSS JOIN S
CROSS JOIN T
WHERE R.a = S.a OR R.a = T.a;

Done.
Done.
Done.
Done.
Done.
Done.
0 rows affected.

[]

Consider the above table definitions and query.  Note the use of `OR`, rather than the more typical `AND` in the condition.

In the following box, describe the semantics of the query --- i.e., what are the query results.  Consider not only the general case, but any special cases as well.  Figuring out what special cases are interesting is part of the problem, and don't forget about NULL!

You can add sample data if you wish, e.g., with `INSERT INTO`.  That would be a good way to test your semantics hypotheses.  However, you should be able to understand the semantics without running the query.

Note that you can use "Markdown" formatting in the following answer box to make your description more readable.

In [58]:
we can select distinct a in R where a is in both R and S or both R and T. It is a union of R intersect T 
and R intersect S.

SyntaxError: invalid syntax (<ipython-input-58-348f81fc0c07>, line 1)

**Your answer:**

# Problem 3 (10 points) -- COMP 533 only

In [13]:
%%sql

DROP TABLE IF EXISTS Data;

CREATE TABLE Data (a INT);

INSERT INTO Data VALUES
    (2),
    (4),
    (5),
    (2),
    (5),
    (1);

Done.
Done.
6 rows affected.

[]

In [14]:
%%sql

SELECT DISTINCT *
FROM Data
WHERE a NOT IN (SELECT data1.a
                FROM Data AS data1
                INNER JOIN Data AS data2 ON data1.a < data2.a);

1 rows affected.

[(5,)]

Consider the above table definition and query.  Note the atypical join condition.

In the following box, describe the semantics of the query --- i.e., what are the query results.  Determining the general case isn't too hard, but identify any special cases as well.  Figuring out what special cases are interesting is part of the problem, and don't forget about NULL!

We have provided one set of sample data.  You may change the set of sample data to account for any special cases.  That would be a good way to test your semantics hypotheses.  However, you should be able to understand the semantics without running the query.

Note that you can use "Markdown" formatting in the following answer box to make your description more readable.

In [ ]:
Select the biggest number in the table. If all elements are equals, result would be null.

**Your answer:**

# Problem 4 (10 points) -- COMP 533 only

The key idea in this problem is that we want to find some interesting value (here, the maximum rating) and then find all of the items with that value.

We give you some data and two example solutions to this problem.  The provided queries are similar to in-class examples.

In [62]:
%%sql

DROP TABLE IF EXISTS Enrollment CASCADE;

CREATE TABLE Enrollment (
    crn INT,
    s_id INT,
    rating INT,
    PRIMARY KEY (crn, s_id)
);

INSERT INTO Enrollment VALUES
    (1, 1, 3),
    (1, 2, 2),
    (1, 3, 3),
    (2, 1, 4),
    (2, 4, 1),
    (3, 1, 5),
    (3, 2, 4),
    (4, 3, 4),
    (5, 2, 5),
    (5, 3, 4),
    (6, 3, 1);

Done.
Done.
11 rows affected.

[]

In [63]:
%%sql

DROP VIEW IF EXISTS MaxRating;

CREATE VIEW MaxRating AS
SELECT crn, Max(rating) AS max_rating
FROM Enrollment
GROUP BY crn;

SELECT *
FROM MaxRating;

Done.
Done.
6 rows affected.

[(4, 4), (1, 3), (5, 5), (3, 5), (6, 1), (2, 4)]

In [64]:
%%sql

SELECT e.crn, e.s_id, e.rating
FROM Enrollment e
INNER JOIN MaxRating mr ON e.crn = mr.crn AND e.rating = mr.max_rating;

7 rows affected.

[(4, 3, 4), (1, 1, 3), (1, 3, 3), (5, 2, 5), (3, 1, 5), (6, 3, 1), (2, 1, 4)]

In [65]:
%%sql

SELECT crn, s_id, rating
FROM Enrollment WHERE (crn, rating) IN (SELECT crn, max_rating FROM MaxRating);

7 rows affected.

[(1, 1, 3), (1, 3, 3), (2, 1, 4), (3, 1, 5), (4, 3, 4), (5, 2, 5), (6, 3, 1)]

Your task is to write an equivalent query that does not use any views or subqueries.  As a hint, the anticipated solution uses a `LEFT OUTER JOIN` and a join condition similar to the previous problem.

In [66]:
%%sql

SELECT e1.crn, e1.s_id, e1.rating FROM Enrollment AS e1
LEFT OUTER JOIN Enrollment AS e2 ON e1.rating < e2.rating AND e1.crn = e2.crn
WHERE e2.crn IS NULL;

7 rows affected.

[(1, 1, 3), (1, 3, 3), (2, 1, 4), (3, 1, 5), (4, 3, 4), (5, 2, 5), (6, 3, 1)]